content/posts/2019-01-03-2018-in-review.zh.md
+++
title = "回顾 2018"
draft = false
date = 2019-01-03
slug = "2018-in-review"
+++

新年快乐！

一年时间的相对长度比起一个人已经度过的时间总是在不停地缩短。如果一年的长度也随着人的年龄增长的话，我们在新年倒计时中的感受大概会有更多的兴奋而非焦虑和不安吧。话说回来，就算没有光追显卡， 2018 年对我来说也很有趣。


## The Amazing 2018 {#the-amazing-2018}

引用 2017 年的自己：

> 如果我有从过去那些我制定后没能执行的计划里得到任何经验的话，那就是定计划时最好稍微低估自己的能力...

是的，从我 2018 年目标的完成状态可以看出，一定是对空闲时间的估计上出了问题。嗯，一定是这样。

-   [ ] 跑 1000 英里。<code>[405/1000]</code>
-   [ ] 完成一次马拉松。
-   [ ] 写 20 篇以上的日志。<code>[10/20]</code>
-   [ ] 获得第一个 PGP 密匙签名。
-   [ ] 安装 Gentoo。

由于使用 `hugo` ，我可以随时更改博客条目的“发布日期”，我养成了撰写文章开头后将其搁置好几个月的坏习惯。当我最后记得那篇未完成的文章时，我经常认为这个想法不值得详细写下去。现在想想，也许这正是博客的目的，它提供了我在某个时间点的快照，使得我可以回顾过去的自己，无论将来的我会觉得这是愚蠢的还是“不值得详细写下去”的。

我在 2018 年的电影院访问次数可能占我一生的总数的 50 ％，但平均失望程度却因为 _星球大战：最后的绝地武士_ 和 _超人总动员 2_ 而翻倍。 顺便一提，2018 年的爆米花消费量也达到了我一生总量的 90 ％。我从来没有意识到爆米花会如此令人上瘾。

尽管不是全程马拉松，但我在 5 月参加了第一次山地半程马拉松比赛。这是我第一次在跑步时感到体力不支，原因是配速不佳以及对天气的准备不足。比赛当天极其炎热，且比赛从下午开始。在目睹许多人在头 2 英里内停下来走路后，由于愚蠢的虚荣心作祟，我的初始速度比我预期的速度要快得多，并在 4 英里的时候不得不因为体力不支停下。所幸，在我走完接下来的一半赛程并在每个补给点大量补充佳得乐后，疲劳的感觉消失了。但是，我没想到那些佳得乐会是另一个陷阱，太阳落山的同时带着气温迅速下降，我的胃开始因为摄入太多冰冷的液体而开始抽搐。当终点线出现在距我视线 400 米以内的地方时，我的双腿受到了我有史以来最强烈的抽筋的打击。在距离终点一步之遥的地方连续被 3 个人超越之后，我终于勉强完成了比赛，但我很高兴得知自己还不是最后一名：实际上，我甚至是我这个（ ~~大概只有一个人完赛的~~ ）年龄组中的第一名。来的名不正言不顺的第一名带来的喜悦，混杂着一点点的不甘心和罪恶感，使那场比赛成为了一次奇妙的经历。


## The Spectacular 2019 {#the-spectacular-2019}

由于 Google 即将在 3 月淘汰 Inbox ，我失去了继续使用 Gmail 的最后借口。 我将逐渐淡化 Gmail 的使用，转向我自己的电子邮件服务器。

说到博客评论的最佳解决方案，我关注的许多博客作者已经开始采用 [IndieWeb](https://indieweb.org/) 和 [Webmention](https://webmention.net/) 。在很多方面， Webmention 正是我想要的东西：它提供了分布式的博客评论、日志等等。 但是，我不愿舍弃静态站点的好处，更不用说我发现大多数易于遵循的 Webmention 解决方案都严重依赖第三方服务。 IndieWeb 运动倒是很吸引人。说起来我的 [Keybase](https://keybase.io/) 除了作为一个联系我不同线上身份的枢纽外并没有太大用处（在线解密和加密功能需要上传 PGP 私钥才能使用，安全消息功能对与并没有什么人可以聊天的我更是派不上用场），也许我应该用 `rel=me` 链接来完全取代它。

去年学习 C++17 的体验非常令人享受，因此我正在考虑学习其他新的编程语言。我已经窥觎 [Rust](https://www.rust-lang.org/) 和 [Julia](https://julialang.org/) 一段时间了，尤其是 Rust 。拥有一整套官方支持的工具链使写 Rust 变得顺畅而愉快。我会尝试深入了解并实际使用这两种语言。

至于跑步和博客日志，我将尝试维持 2018 年的数字。除此之外，我考虑在博客上记录看/听/读过的书籍，音乐和节目，以及自己的想法。过去在本站的 Wordpress 时代，我有过类似的尝试：我搭建了一个 MediaWiki 实例来记录这些，但缺乏继续维护条目的动力。这次我会用一些更轻量的解决办法，并且构思一套评分系统。

我应该如何处理其余的 2018 年目标呢？单独的愿望清单是一个很好的主意。作为一个额外目标，我应该清理一下那台堆积了四年份灰尘、猫毛和死皮细胞的台式机。

为接下来的 2.9e+17 个铯 133 辐射周期干杯！
